app/Http/Controllers/AboutMbkmController.php

    public function index()
    {
        // Assuming there's only one profile to be edited
        $aboutMbkm = AboutMbkm::first();
---
select * from `about_mbkms`