app/Http/Controllers/AktivitasMbkmController.php

    public function index(Request $request)
    {
        $user = Auth::user();
        $pesertaId = $request->input('peserta_id');

        // Mengambil daftar peserta berdasarkan kriteria yang sudah ditentukan
        $daftarPeserta = Peserta::whereHas('registrationPlacement.lowongan.mitra', function ($query) use ($user) {
            $query->where('user_id', $user->id);
        })->get();
---
select * from `peserta` where `peserta`.`user_id` = 7 and `peserta`.`user_id` is not null limit 1

    public function createLaporanHarian()
    {
        $user = Auth::user();
        $namaPeserta = $user->peserta->nama;
        $startOfWeek = \Carbon\Carbon::now()->startOfWeek();
        $endOfWeek = \Carbon\Carbon::now()->endOfWeek();

        $laporanHarian = LaporanHarian::where('peserta_id', $user->peserta->id)
            ->whereBetween('tanggal', [$startOfWeek, $endOfWeek])
            ->get()
            ->keyBy('tanggal');
---
select * from `laporan_harian` where `peserta_id` = 2 and `tanggal` between '2024-06-24 00:00:00' and '2024-06-30 23:59:59'

    public function createLaporanMingguan()
    {
        $user = Auth::user();
        $namaPeserta = $user->peserta->nama;

        $semesterStart = \Carbon\Carbon::parse(env('SEMESTER_START'));
        $semesterEnd = \Carbon\Carbon::parse(env('SEMESTER_END'));
        $currentWeek = \Carbon\Carbon::now()->diffInWeeks($semesterStart) + 1;
        $totalWeeks = $semesterStart->diffInWeeks($semesterEnd) + 1;

        $laporanMingguan = LaporanMingguan::where('peserta_id', $user->peserta->id)
            ->get()
            ->keyBy('minggu_ke');

        $totalLaporan = $laporanMingguan->count();
        $validasiLaporan = $laporanMingguan->where('status', 'validasi')->count();
        $revisiLaporan = $laporanMingguan->where('status', 'revisi')->count();
        $pendingLaporan = $laporanMingguan->where('status', 'pending')->count();

        $weeks = [];
        for ($i = 0; $i < $totalWeeks; $i++) {
            $startOfWeek = $semesterStart->copy()->addWeeks($i)->startOfWeek();
            $endOfWeek = $startOfWeek->copy()->endOfWeek();
            $isComplete = AktivitasMbkm::isWorkWeekReportComplete($user->peserta->id, $startOfWeek, $endOfWeek);
            $weekLaporanMingguan = LaporanMingguan::where('peserta_id', $user->peserta->id)
                ->where('minggu_ke', $i + 1)
                ->first();
---
select * from `laporan_mingguan` where `peserta_id` = 2
select * from `laporan_mingguan` where `peserta_id` = 2 and `minggu_ke` = 1 limit 1

    public function createLaporanLengkap()
    {
        $user = Auth::user();
        $aktivitas = AktivitasMbkm::where('peserta_id', $user->id)->first();
---
select * from `aktivitas_mbkm` where `peserta_id` = 7 limit 1

    public function storeLaporanHarian(Request $request)
    {
        $request->validate([
            'tanggal' => 'required|date',
            'isi_laporan' => 'required|string',
            'kehadiran' => 'required|string',
        ]);

        $user = Auth::user();

        $semesterStart = env('SEMESTER_START');
        $semesterEnd = env('SEMESTER_END');

        $user->load(['peserta.registrationPlacement.lowongan']);

        // Menggunakan updateOrCreate untuk memperbarui data yang ada atau membuat baru jika tidak ada
        $laporanHarian = LaporanHarian::updateOrCreate(
            [
                'peserta_id' => $user->peserta->id,
                'mitra_id' => $user->peserta->registrationPlacement->lowongan->mitra_id,
                'tanggal' => $request->tanggal,
            ],
            [
                'isi_laporan' => $request->isi_laporan,
                'status' => 'pending',
                'kehadiran' => $request->kehadiran,
            ]
        );
---
select * from `peserta` where `peserta`.`user_id` = 7 and `peserta`.`user_id` is not null limit 1
insert into `laporan_harian` (`peserta_id`, `mitra_id`, `tanggal`, `isi_laporan`, `status`, `kehadiran`, `updated_at`, `created_at`) values (2, 1, '2024-06-19', 'asd', 'pending', 'hadir', '2024-06-25 02:00:53', '2024-06-25 02:00:53')
select * from `laporan_harian` where (`peserta_id` = 2 and `mitra_id` = 1 and `tanggal` = '2024-06-19') limit 1
select * from `lowongans` where `lowongans`.`id` in (2)
select * from `peserta` where `peserta`.`user_id` in (7)

    public function storeLaporanLengkap(Request $request)
    {
        $request->validate([
            'tanggal' => 'required|date',
            'isi_laporan' => 'required|string',
        ]);

        $user = Auth::user();
        $aktivitas = AktivitasMbkm::where('peserta_id', $user->id)->first();
---
select * from `aktivitas_mbkm` where `peserta_id` = 1 limit 1

    public function validateLaporanHarian(Request $request, $id)
    {
        $laporanHarian = LaporanHarian::findOrFail($id);

        if ($laporanHarian->mitra->user_id != Auth::id()) {
            return back()->withErrors('Anda tidak memiliki izin untuk memvalidasi laporan ini.');
        }

        if ($request->action == 'validasi') {
            $laporanHarian->update(['status' => 'validasi']);
            return back()->with('success', 'Laporan harian berhasil divalidasi.');
        } elseif ($request->action == 'revisi') {
            $laporanHarian->update(['status' => 'revisi']);
---
select * from `laporan_harian` where `laporan_harian`.`id` = '49' limit 1
update `laporan_harian` set `status` = 'validasi', `laporan_harian`.`updated_at` = '2024-06-25 02:03:26' where `id` = 51