app/Http/Controllers/AktivitasMbkmController.php

select * from `peserta` where `peserta`.`user_id` = 7 and `peserta`.`user_id` is not null limit 1
---
    public function createLaporanMingguan()
    {
        $user = Auth::user();
        $peserta = Peserta::with('registrationPlacement')->where('user_id', $user->id)->first();

select * from `lowongans` where `lowongans`.`id` in (2)
select * from `peserta` where `peserta`.`user_id` in (7)
---
    public function storeLaporanLengkap(Request $request)
    {
        $request->validate([
            'isi_laporan' => 'required|string',
            'dokumen' => 'nullable|file|mimes:pdf,doc,docx', // Validasi dokumen
        ]);

        $user = Auth::user();
        $aktivitas = AktivitasMbkm::where('peserta_id', $user->peserta->id)->first();

        if (!$aktivitas) {
            return back()->withErrors(['error' => 'Aktivitas tidak ditemukan. Pastikan Anda terdaftar dalam kegiatan MBKM.']);
        }

        $laporanLengkap = LaporanLengkap::updateOrCreate(
            [
                'peserta_id' => $aktivitas->peserta_id,
                'mitra_id' => $user->peserta->registrationPlacement->lowongan->mitra_id,
                'dospem_id' => $user->peserta->registrationPlacement->dospem_id,
            ],
            [
                'isi_laporan' => $request->isi_laporan,
                'status' => 'pending',
            ]
        );