app/Http/Controllers/DosenPembimbingLapanganController.php

    public function index()
    {
        $dosenPembimbingLapangan = DosenPembimbingLapangan::all();
---
select * from `dosen_pembimbing_lapangan`

    public function create()
    {
        $dosen = Dosen::all();
---
select * from `dosen`

    public function store(Request $request)
    {
        // Validasi request
        $request->validate([
            'dosen_id' => 'required|exists:mysql_second.dosen,Login', // Menggunakan 'Login' sebagai primary key
            'password' => 'required|confirmed|min:8',
        ]);

        // Mulai transaksi
        DB::beginTransaction();

        try {
            // Mengambil data dosen dari database kedua
            $dosen = Dosen::where('Login', $request->dosen_id)->firstOrFail();

            // Check for existing email or name in DosenPembimbingLapangan
            if (DosenPembimbingLapangan::where('email', $dosen->Email)->exists()) {
                return back()->withErrors(['email' => 'Email already exists in Dosen Pembimbing Lapangan'])->withInput();
            }

            if (DosenPembimbingLapangan::where('name', $dosen->Nama)->exists()) {
                return back()->withErrors(['name' => 'Name already exists in Dosen Pembimbing Lapangan'])->withInput();
            }

            // Membuat user baru
            $user = User::create([
                'name' => $dosen->Nama,
                'email' => $dosen->Email,
                'password' => Hash::make($request->password),
            ]);
---
select exists(select * from `dosen_pembimbing_lapangan` where `email` = 'dosen2@mail.com') as `exists`
select exists(select * from `dosen_pembimbing_lapangan` where `name` = 'Dr. Budi Satria') as `exists`
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Dr. Budi Satria', 'dosen2@mail.com', '$2y$12$9X0fb78P7RkVVCmK1v.0WOUGINfZmtc8NUuQt4s6yAOyRcKu7TFr2', '2024-06-25 01:37:42', '2024-06-25 01:37:42')

            $user->assignRole($role);

            // Membuat dosen pembimbing lapangan baru
            DosenPembimbingLapangan::create([
                'user_id' => $user->id,
                'name' => $dosen->Nama,
                'email' => $dosen->Email,
                'nip' => $dosen->NIPPNS,
                'address' => $dosen->TempatLahir,
                'phone' => $dosen->phone,
                'image' => 'default.jpg',
            ]);
---
insert into `dosen_pembimbing_lapangan` (`user_id`, `name`, `email`, `nip`, `address`, `phone`, `image`, `updated_at`, `created_at`) values (10, 'Dr. Budi Satria', 'dosen2@mail.com', 'D002', 'Jl. Jendral Sudirman No.2, Bandung', '', 'default.jpg', '2024-06-25 01:37:42', '2024-06-25 01:37:42')