app/Http/Controllers/LowonganController.php

select * from `lowongans`
select * from `mitra_profile`
---
    public function index()
    {
        if (auth()->user()->hasRole('mitra')) {
            // Jika user memiliki role mitra, tampilkan lowongan yang terkait dengan mitra mereka
            $mitraProfile = MitraProfile::where('user_id', auth()->user()->id)->first();
            $lowongan = Lowongan::where('mitra_id', $mitraProfile->id)->get();
        } else {
            // Jika user bukan mitra, tampilkan semua lowongan
            $lowongan = Lowongan::all();
            $mitraProfile = MitraProfile::all(); // Hanya digunakan di view untuk memilih mitra