app/Http/Controllers/MitraProfileController.php

select * from `mitra_profile`
---
    public function index()
    {
        $mitraProfile = MitraProfile::all();