app/Http/Controllers/RegistrasiController.php

select * from `lowongans`
---
    public function showPesertaRegistrasiForm()
    {
        $lowongans = Lowongan::all();

select * from `registrasi`
select * from `peserta`
select * from `dosen_pembimbing_lapangan`
---
    public function index()
    {
        $registrations = Registrasi::with('dospem')->get();
        $pesertas = Peserta::all();
        $dospems = DosenPembimbingLapangan::all();

select * from `registrasi` where `peserta_id` = '2' and `lowongan_id` = '2' limit 1
---
    public function store(Request $request)
    {
        $request->validate([
            'peserta_id' => 'required|exists:peserta,id',
            'lowongan_id' => 'required|exists:lowongans,id',
        ]);

        $pesertaId = $request->input('peserta_id');
        $lowonganId = $request->input('lowongan_id');

        $existingRegistration = Registrasi::where('peserta_id', $pesertaId)
            ->where('lowongan_id', $lowonganId)
            ->first();