app/Models/AktivitasMbkm.php

select count(*) as aggregate from `laporan_harian` where `peserta_id` = 2 and `tanggal` between '2024-06-17 00:00:00' and '2024-06-23 23:59:59' and `tanggal` in ('2024-06-17 00:00:00', '2024-06-18 00:00:00', '2024-06-19 00:00:00', '2024-06-20 00:00:00', '2024-06-21 00:00:00')
---
    public static function isWorkWeekReportComplete($userId, $startOfWeek, $endOfWeek)
    {
        // Mendapatkan tanggal Senin hingga Jumat dari minggu tersebut
        $workDays = \Carbon\CarbonPeriod::create($startOfWeek, '1 day', $endOfWeek)->filter(function ($date) {
            return $date->isWeekday();
        });

        $countHarian = LaporanHarian::where('peserta_id', $userId)
            ->whereBetween('tanggal', [$startOfWeek, $endOfWeek])
            ->whereIn('tanggal', $workDays->toArray())
            ->count();