app/Models/LaporanLengkap.php

select * from `laporan_lengkap` where exists (select * from `dosen_pembimbing_lapangan` where `laporan_lengkap`.`dospem_id` = `dosen_pembimbing_lapangan`.`id` and `user_id` = 3) and `peserta_id` = '2'
---
    public static function getByUser($user, $pesertaId = null, $batchId = null) // Tambahkan batchId
    {
        $query = self::with(['peserta', 'dospem'])
            ->whereHas('dospem', function ($query) use ($user) {
                $query->where('user_id', $user->id);
            });