app/Models/LaporanHarian.php

select * from `laporan_harian` where exists (select * from `mitra_profile` where `laporan_harian`.`mitra_id` = `mitra_profile`.`id` and `user_id` = 3) and `peserta_id` = '2'
select * from `peserta` where `peserta`.`id` in (2)
---
    public static function getByUser($user, $pesertaId = null)
    {
        $query = self::with(['peserta', 'mitra'])
            ->whereHas('mitra', function ($query) use ($user) {
                $query->where('user_id', $user->id);
            });