app/Models/LaporanMingguan.php

    public static function getByUser($user)
    {
        return self::with(['peserta', 'mitra'])
            ->whereHas('mitra', function ($query) use ($user) {
                $query->where('user_id', $user->id);
            })->get();
---
select * from `laporan_mingguan` where exists (select * from `mitra_profile` where `laporan_mingguan`.`mitra_id` = `mitra_profile`.`id` and `user_id` = 3) and `peserta_id` = '2'
select * from `peserta` where `peserta`.`id` in (2)